FV2310/E_0061.dot
digraph D {
    labelloc="t";
    label=<<B><FONT POINT-SIZE="18">MaBiS</FONT></B><BR/><BR/><B><FONT POINT-SIZE="16">7.51.3: AD: Übermittlung Datenstatus des Deltazeitreihenübertrags vom BIKO an ÜNB und NB</FONT></B><BR/><BR/><BR/><BR/>>;
    "Start" [margin="0.2,0.12", shape=box, style=filled, fillcolor="#7a8da1", label=<<B>E_0061</B><BR align="center"/><FONT point-size="12"><B><U>Prüfende Rolle:</U> BIKO</B></FONT><BR align="center"/>>];
    "1" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>1: </B>Ist die eingegangene Prüfmitteilung positiv?<BR align="left"/>>];
    "A**" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A**</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Hinweis: A** wird durch richtigen Code aus dem System des BIKO ersetzt. Mögliche Codes sind:<BR align="left"/>A01	Datenstatus „Abrechnungsdaten“<BR align="left"/>A04	Datenstatus „Abrechnungsdaten KBKA“<BR align="left"/></FONT>>];
    "2" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>2: </B>Liegt der Datenstatus „Prüfdaten“ vor?<BR align="left"/>>];
    "3" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>3: </B>Erfolgt der Eingang der Prüfmitteilung innerhalb der Clearingphase für DZÜ der BKA (ohne KBKA)?<BR align="left"/>>];
    "A01" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A01</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Datenstatus „Abrechnungsdaten“<BR align="left"/></FONT>>];
    "A04" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A04</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Datenstatus „Abrechnungsdaten KBKA“<BR align="left"/></FONT>>];

    "Start" -> "1";
    "1" -> "A**" [label="Nein"];
    "1" -> "2" [label="Ja"];
    "2" -> "A**" [label="Nein"];
    "2" -> "3" [label="Ja"];
    "3" -> "A01" [label="Ja"];
    "3" -> "A04" [label="Nein"];

    bgcolor="transparent";
}
